Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.ProfileEnd Property
 Gets or sets the end profile of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCrossSection ProfileEnd { get; set; }
Public Property ProfileEnd As AnalysisCrossSection
	Get
	Set
Property Value
Type: AnalysisCrossSection
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace